wrk2/results/no_istio_20251230_154433/wrk_logs/wrk_800rps_rep2.log
Running 1m test @ http://192.168.49.2:30918
  4 threads and 100 connections

  Thread calibration: mean lat.: 1169.350ms, rate sampling interval: 5115ms
  Thread calibration: mean lat.: 1276.622ms, rate sampling interval: 5517ms
  Thread calibration: mean lat.: 1242.144ms, rate sampling interval: 5885ms
  Thread calibration: mean lat.: 1216.351ms, rate sampling interval: 5308ms

-----------------------------------------------------------------------
Test Results @ http://192.168.49.2:30918 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     8.90s     4.79s   20.63s    64.90%
    Req/Sec   144.74     12.13   166.00     71.43%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.39s 
 75.000%   12.24s 
 90.000%   15.67s 
 99.000%   20.63s 
 99.900%   23.12s 
 99.990%   24.43s 
 99.999%   25.25s 
100.000%   25.25s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.136     0.000000            1         1.00
    2983.935     0.100000         2901         1.11
    4431.871     0.200000         5804         1.25
    5812.223     0.300000         8705         1.43
    7135.231     0.400000        11602         1.67
    8388.607     0.500000        14499         2.00
    9060.351     0.550000        15961         2.22
    9740.287     0.600000        17408         2.50
   10551.295     0.650000        18857         2.86
   11370.495     0.700000        20299         3.33
   12238.847     0.750000        21755         4.00
   12705.791     0.775000        22471         4.44
   13107.199     0.800000        23196         5.00
   13680.639     0.825000        23923         5.71
   14278.655     0.850000        24656         6.67
   14901.247     0.875000        25383         8.00
   15278.079     0.887500        25732         8.89
   15671.295     0.900000        26100        10.00
   16097.279     0.912500        26464        11.43
   16531.455     0.925000        26822        13.33
   16990.207     0.937500        27185        16.00
   17235.967     0.943750        27365        17.78
   17514.495     0.950000        27545        20.00
   17809.407     0.956250        27732        22.86
   18169.855     0.962500        27919        26.67
   18513.919     0.968750        28095        32.00
   18694.143     0.971875        28185        35.56
   18890.751     0.975000        28272        40.00
   19185.663     0.978125        28359        45.71
   19496.959     0.981250        28453        53.33
   19775.487     0.984375        28541        64.00
   19988.479     0.985938        28586        71.11
   20250.623     0.987500        28631        80.00
   20496.383     0.989062        28677        91.43
   20774.911     0.990625        28725       106.67
   21069.823     0.992188        28768       128.00
   21233.663     0.992969        28790       142.22
   21397.503     0.993750        28812       160.00
   21708.799     0.994531        28835       182.86
   21921.791     0.995313        28859       213.33
   22069.247     0.996094        28880       256.00
   22183.935     0.996484        28893       284.44
   22315.007     0.996875        28903       320.00
   22577.151     0.997266        28915       365.71
   22790.143     0.997656        28928       426.67
   22888.447     0.998047        28941       512.00
   22904.831     0.998242        28945       568.89
   22937.599     0.998437        28949       640.00
   22986.751     0.998633        28954       731.43
   23101.439     0.998828        28962       853.33
   23150.591     0.999023        28965      1024.00
   23199.743     0.999121        28970      1137.78
   23216.127     0.999219        28972      1280.00
   23232.511     0.999316        28974      1462.86
   23412.735     0.999414        28977      1706.67
   23461.887     0.999512        28980      2048.00
   23560.191     0.999561        28981      2275.56
   23642.111     0.999609        28983      2560.00
   23822.335     0.999658        28985      2925.71
   23822.335     0.999707        28985      3413.33
   23838.719     0.999756        28987      4096.00
   23838.719     0.999780        28987      4551.11
   24084.479     0.999805        28988      5120.00
   24248.319     0.999829        28989      5851.43
   24248.319     0.999854        28989      6826.67
   24428.543     0.999878        28990      8192.00
   24428.543     0.999890        28990      9102.22
   24805.375     0.999902        28991     10240.00
   24805.375     0.999915        28991     11702.86
   24805.375     0.999927        28991     13653.33
   25116.671     0.999939        28992     16384.00
   25116.671     0.999945        28992     18204.44
   25116.671     0.999951        28992     20480.00
   25116.671     0.999957        28992     23405.71
   25116.671     0.999963        28992     27306.67
   25247.743     0.999969        28993     32768.00
   25247.743     1.000000        28993          inf
#[Mean    =     8902.298, StdDeviation   =     4785.645]
#[Max     =    25231.360, Total count    =        28993]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  35116 requests in 1.00m, 11.68MB read
Requests/sec:    584.96  
Transfer/sec:    199.16KB